posts/2015-01-13-twenty-third-sunday-after-pentecost.org
#+date: <2015-01-13>
#+filetags: prayer religion
#+title: Twenty-Third Sunday After Pentecost

Actors of old wore masks\\
to hide their true selves,\\
with smiles and frowns\\
frozen into place.\\
\\
They wore expressions,\\
not of who they really were,\\
but of who someone thought they should be.
\\
We call our masks\\
by different names:\\
Facebook,\\
Twitter,\\
Social media;\\
still used to\\
project an image,\\
one that even we ourselves\\
can eventually come to believe.
\\
Lord Jesus, you summed up the law and\\
the prophets in one simple statement:\\
do to others what you would\\
want them to do to you.
\\
But how can I do that\\
if I cannot face who I really am?
\\
Holy Spirit, cleanse me of\\
the sin of self-deception\\
and open my eyes to\\
who I truly am\\
and what I truly want,\\
that I may truly serve.

/Amen/





#+begin_tagline
Tagged: prayer religion
#+end_tagline
