docs/posts/2015-01-13-twenty-third-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Twenty-Third Sunday After Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Twenty-Third Sunday After Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
Actors of old wore masks<br>
to hide their true selves,<br>
with smiles and frowns<br>
frozen into place.<br>
<br>
They wore expressions,<br>
not of who they really were,<br>
but of who someone thought they should be.
<br>
We call our masks<br>
by different names:<br>
Facebook,<br>
Twitter,<br>
Social media;<br>
still used to<br>
project an image,<br>
one that even we ourselves<br>
can eventually come to believe.
<br>
Lord Jesus, you summed up the law and<br>
the prophets in one simple statement:<br>
do to others what you would<br>
want them to do to you.
<br>
But how can I do that<br>
if I cannot face who I really am?
<br>
Holy Spirit, cleanse me of<br>
the sin of self-deception<br>
and open my eyes to<br>
who I truly am<br>
and what I truly want,<br>
that I may truly serve.
</p>

<p>
<i>Amen</i>
</p>





<div class="tagline" id="org4c35869">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
